; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared6 - mode
	spectrograph3 - mode
	thermograph1 - mode
	thermograph5 - mode
	image2 - mode
	spectrograph0 - mode
	spectrograph4 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	Star3 - direction
	GroundStation5 - direction
	Star4 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph5)
	(supports instrument0 infrared6)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph4)
	(supports instrument2 image2)
	(calibration_target instrument2 Star3)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(have_image Star9 spectrograph0)
	(have_image Phenomenon10 spectrograph4)
	(have_image Phenomenon10 infrared6)
	(have_image Star11 spectrograph3)
	(have_image Planet12 spectrograph4)
	(have_image Phenomenon13 image2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 6
3. (turn_to satellite1 phenomenon10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon10)
   goals met: 0 of 6
4. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 6
5. (take_image satellite1 phenomenon10 instrument2 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 1 of 6
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
7. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 6
8. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 6
9. (take_image satellite0 phenomenon10 instrument0 infrared6)
   added: (have_image phenomenon10 infrared6)
   goals met: 2 of 6
10. (turn_to satellite0 star11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star11)
   goals met: 2 of 6
11. (take_image satellite0 star11 instrument0 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 3 of 6
12. (turn_to satellite1 phenomenon13 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon13)
   goals met: 3 of 6
13. (take_image satellite1 phenomenon13 instrument2 image2)
   added: (have_image phenomenon13 image2)
   goals met: 4 of 6
14. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   goals met: 4 of 6
15. (take_image satellite1 planet12 instrument2 spectrograph4)
   added: (have_image planet12 spectrograph4)
   goals met: 5 of 6
16. (turn_to satellite1 star9 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star9)
   goals met: 5 of 6
17. (take_image satellite1 star9 instrument2 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 6 of 6
